; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x2-y4-t1-k2-l2-p50)
(:domain grid)
(:objects 
        f0-0f f1-0f 
        f0-1f f1-1f 
        f0-2f f1-2f 
        f0-3f f1-3f 
        shape0 
        key0-0 key0-1 
)
(:init
(arm-empty)
(place f0-0f)
(place f1-0f)
(place f0-1f)
(place f1-1f)
(place f0-2f)
(place f1-2f)
(place f0-3f)
(place f1-3f)
(shape shape0)
(key key0-0)
(key-shape key0-0 shape0)
(key key0-1)
(key-shape key0-1 shape0)
(conn f0-0f f1-0f)
(conn f0-1f f1-1f)
(conn f0-2f f1-2f)
(conn f0-3f f1-3f)
(conn f0-0f f0-1f)
(conn f1-0f f1-1f)
(conn f0-1f f0-2f)
(conn f1-1f f1-2f)
(conn f0-2f f0-3f)
(conn f1-2f f1-3f)
(conn f1-0f f0-0f)
(conn f1-1f f0-1f)
(conn f1-2f f0-2f)
(conn f1-3f f0-3f)
(conn f0-1f f0-0f)
(conn f1-1f f1-0f)
(conn f0-2f f0-1f)
(conn f1-2f f1-1f)
(conn f0-3f f0-2f)
(conn f1-3f f1-2f)
(open f0-0f)
(open f1-1f)
(open f0-2f)
(open f1-2f)
(open f0-3f)
(open f1-3f)
(locked f1-0f)
(lock-shape f1-0f shape0)
(locked f0-1f)
(lock-shape f0-1f shape0)
(at key0-0 f0-1f)
(at key0-1 f1-3f)
(at-robot f0-2f)
)
(:goal
(and
(at key0-0 f1-3f)
)
)
)

; plan
1. (move f0-2f f0-3f)
   deleted: (at-robot f0-2f)
   added: (at-robot f0-3f)
   goals met: 0 of 1
2. (move f0-3f f1-3f)
   deleted: (at-robot f0-3f)
   added: (at-robot f1-3f)
   goals met: 0 of 1
3. (pickup f1-3f key0-1)
   deleted: (at key0-1 f1-3f) (arm-empty)
   added: (holding key0-1)
   goals met: 0 of 1
4. (move f1-3f f0-3f)
   deleted: (at-robot f1-3f)
   added: (at-robot f0-3f)
   goals met: 0 of 1
5. (move f0-3f f0-2f)
   deleted: (at-robot f0-3f)
   added: (at-robot f0-2f)
   goals met: 0 of 1
6. (unlock f0-2f f0-1f key0-1 shape0)
   deleted: (locked f0-1f)
   added: (open f0-1f)
   goals met: 0 of 1
7. (move f0-2f f0-1f)
   deleted: (at-robot f0-2f)
   added: (at-robot f0-1f)
   goals met: 0 of 1
8. (pickup-and-loose f0-1f key0-0 key0-1)
   deleted: (holding key0-1) (at key0-0 f0-1f)
   added: (holding key0-0) (at key0-1 f0-1f)
   goals met: 0 of 1
9. (move f0-1f f0-2f)
   deleted: (at-robot f0-1f)
   added: (at-robot f0-2f)
   goals met: 0 of 1
10. (move f0-2f f1-2f)
   deleted: (at-robot f0-2f)
   added: (at-robot f1-2f)
   goals met: 0 of 1
11. (move f1-2f f1-3f)
   deleted: (at-robot f1-2f)
   added: (at-robot f1-3f)
   goals met: 0 of 1
12. (putdown f1-3f key0-0)
   deleted: (holding key0-0)
   added: (arm-empty) (at key0-0 f1-3f)
   goals met: 1 of 1
